Page({
  data: {

    // 挂号级别
    registrationLevelCast: {
      1: "普通号",
      2: "专家号",
      3: "急诊号"
    },

    // 结算类别
    payTypeCast: {
      1: "自费",
      2: "医保",
      3: "新农合"
    },

    // 缴费状态
    paymentStatusCast: {
        1: "未缴费",
        2: "已缴费",
        3: "已退费",
        4: "冲正",
        5: "作废",
        6: "冻结"
    },

    // 用户类别
    userTypeCast: {
        1: "挂号收费员",
        2: "门诊医生",
        3: "医技医生",
        4: "药房操作员",
        5: "财务管理员",
        6: "医院管理员"
    },

    // 医技项目状态
    techProjectStatusCast: {
        1: "暂存",
        2: "开立",
        3: "作废",
        4: "已登记",
        5: "执行完毕"
    },

    // 药方状态
    recipeStatusCast: {
        1: "暂存",
        2: "开立",
        3: "作废",
        4: "已取药",
        5: "已退药"
    },

    // 挂号状态
    registrationStatusCast: {
        0: "已退号",
        1: "正常"
    },

    // 病历状态
    caseStatusCast: {
        1: "待诊",
        2: "暂存",
        3: "已诊（未确诊）",
        4: "确诊",
        5: "诊毕"
    },

    // 看诊时间段
    timeSlotCast: {
        1: "上午",
        2: "下午"
    },

    // 性别
    genderCast: {
        0: "女",
        1: "男"
    }
  },

})
